genua/anoubis_os/openbsd/openbsd-git/share/man/man9/vfs_extattr.9
.\"
.\" Copyright (c) 1999, 2000, 2001, 2003 Robert N. M. Watson
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: extattr.9,v 1.17 2007/03/06 08:13:21 mckusick Exp $
.\"
.Dd December 23, 1999
.Os
.Dt VFS_EXTATTR 9
.Sh NAME
.Nm vfs_extattr
.Nd VFS extended attributes
.Sh DESCRIPTION
The
.Nm
suite of functions allow additional metadata to be associated with vnodes
representing files, directories and symbolic links.
.Pp
The semantics of this additional data are that of a "name, value" pair, where
a name may be defined or undefined, and if defined, associated with zero or
more bytes of arbitrary binary data.
.Pp
Extended attribute names exist within a set of namespaces. Each operation
on an extended attribute is required to provide the namespace to which the
operation refers.
.Pp
If the same name is present in multiple namespaces, the extended attributes
associated with the names are stored and manipulated independently.
.Pp
Two namespaces are defined universally:
.Dv EXTATTR_NAMESPACE_USER and
.Dv EXTATTR_NAMESPACE_SYSTEM .
Individual file systems may implement additional namespaces.
.Pp
The semantics of these attributes are intended to be as follows:
.Pp
.Dv EXTATTR_NAMESPACE_USER
attribute data is protected according the normal discretionary
and mandatory protections associated with the data in the file or
directory.
.Pp
.Dv EXATTR_NAMESPACE_SYSTEM
system attribute data is protected such that appropriate privilege is required
to directly access or manipulate these attributes.
.Sh ACTIVATION
In
.Ox ,
extended attributes functionality can be turned on for FFS2 by enabling the
.Dv FFS2_EXTATTR
option and compiling a new kernel. See
.Xr options 9
for instructions.
.Sh CAVEATS
As there are a plethora of file systems with differing extended attributes,
availability and functionality of these functions may be limited, and they
should be used with awareness of the underlying semantics of the supporting
file system.
.Pp
Authorization schemes for extended attribute data may also vary by file
system, as well as maximum attribute size, and whether or not any or
specific new attributes may be defined.
.Pp
Extended attributes are named using a null-terminated character string.
Depending on underlying file system semantics, this name may or may not be
case-sensitive.
.Sh SEE ALSO
.Xr vfs 9 ,
.Xr VOP_GETEXTATTR 9 ,
.Xr VOP_LISTEXTATTR 9 ,
.Xr VOP_SETEXTATTR 9
